robertinant/emt/src/ti/runtime/wiring/cc3200/UARTCC3200.c
    /* Disable UART and interrupts. */
    MAP_UARTIntDisable(hwAttrs->baseAddr, UART_INT_TX | UART_INT_RX |
        UART_INT_RT | UART_INT_OE | UART_INT_BE | UART_INT_PE | UART_INT_FE);
    MAP_UARTDisable(hwAttrs->baseAddr);

    if (object->hwiHandle) {
        HwiP_delete(object->hwiHandle);
    }
    if (object->writeSem) {
        SemaphoreP_delete(object->writeSem);
    }
    if (object->readSem) {
        SemaphoreP_delete(object->readSem);
    }
    if (object->timeoutClk) {
        ClockP_delete(object->timeoutClk);
    }

    if (object->txFifoEmptyClk) {
        ClockP_stop((ClockP_Handle)object->txFifoEmptyClk);
        ClockP_delete(object->txFifoEmptyClk);
    }

    if (object->state.txEnabled) {
        Power_releaseConstraint(PowerCC3200_DISALLOW_LPDS);
        object->state.txEnabled = false;
    }

    Power_unregisterNotify(&object->postNotify);
    if (object->state.rxEnabled) {
        Power_releaseConstraint(PowerCC3200_DISALLOW_LPDS);
        object->state.rxEnabled = false;

        DebugP_log1("UART:(%p) UART_close released read power constraint",
            hwAttrs->baseAddr);
    }
    Power_releaseDependency(object->powerMgrId);

    object->state.opened = false;

    DebugP_log1("UART:(%p) closed", hwAttrs->baseAddr);
}

/*
 *  ======== UARTCC3200_control ========
 *  @pre    Function assumes that the handle is not NULL
 */
int UARTCC3200_control(UART_Handle handle, unsigned int cmd, void *arg)
{
    UARTCC3200_Object          *object = handle->object;
    UARTCC3200_HWAttrs const   *hwAttrs = handle->hwAttrs;
    unsigned char               data;
    int                         bufferCount;

    bufferCount = RingBuf_peek(&object->ringBuffer, &data);

    switch (cmd) {
        /* Common UART CMDs */
        case (UART_CMD_PEEK):
            *(int *)arg = (bufferCount) ? data : UART_ERROR;
            DebugP_log2("UART:(%p) UART_CMD_PEEK: %d", hwAttrs->baseAddr,
                *(uintptr_t*)arg);
            return (UART_STATUS_SUCCESS);

        case (UART_CMD_ISAVAILABLE):
            *(bool *)arg = (bufferCount != 0);
            DebugP_log2("UART:(%p) UART_CMD_ISAVAILABLE: %d", hwAttrs->baseAddr,
                *(uintptr_t*)arg);
            return (UART_STATUS_SUCCESS);

        case (UART_CMD_GETRXCOUNT):
            *(int *)arg = bufferCount;
            DebugP_log2("UART:(%p) UART_CMD_GETRXCOUNT: %d", hwAttrs->baseAddr,
                *(uintptr_t*)arg);
            return (UART_STATUS_SUCCESS);

        case (UART_CMD_RXENABLE):
            if (!object->state.rxEnabled) {
                Power_setConstraint(PowerCC3200_DISALLOW_LPDS);
                MAP_UARTIntEnable(hwAttrs->baseAddr, UART_INT_RX | UART_INT_RT);
                object->state.rxEnabled = true;
                DebugP_log1("UART:(%p) UART_CMD_RXENABLE: Enabled",
                    hwAttrs->baseAddr);
                DebugP_log1("UART:(%p) UART_control set read power constraint",
                    hwAttrs->baseAddr);
                return (UART_STATUS_SUCCESS);
            }
            DebugP_log1("UART:(%p) UART_CMD_RXENABLE: Already enabled",
                hwAttrs->baseAddr);
            return (UART_STATUS_ERROR);

        case (UART_CMD_RXDISABLE):
            if (object->state.rxEnabled) {
                MAP_UARTIntDisable(hwAttrs->baseAddr, UART_INT_RX | UART_INT_RT);
                Power_releaseConstraint(PowerCC3200_DISALLOW_LPDS);
                object->state.rxEnabled = false;
                DebugP_log1("UART:(%p) UART_CMD_RXDISABLE: Disabled",
                    hwAttrs->baseAddr);
                DebugP_log1("UART:(%p) UART_control released read power "
                    "constraint", hwAttrs->baseAddr);
                return (UART_STATUS_SUCCESS);
            }
            DebugP_log1("UART:(%p) UART_CMD_RXDISABLE: Already disabled",
                hwAttrs->baseAddr);
            return (UART_STATUS_ERROR);

        default:
            DebugP_log2("UART:(%p) UART CMD undefined: %d",
                hwAttrs->baseAddr, cmd);
            return (UART_STATUS_UNDEFINEDCMD);
    }
}

/*
 *  ======== UARTCC3200_hwiIntFxn ========
 *  Hwi function that processes UART interrupts.
 *
 *  @param(arg)         The UART_Handle for this Hwi.
 */
static void UARTCC3200_hwiIntFxn(uintptr_t arg)
{
    uint32_t                     status;
    UARTCC3200_Object           *object = ((UART_Handle)arg)->object;
    UARTCC3200_HWAttrs const    *hwAttrs = ((UART_Handle)arg)->hwAttrs;
    uint32_t                     rxErrors;

    /* Clear interrupts */
    status = MAP_UARTIntStatus(hwAttrs->baseAddr, true);
    MAP_UARTIntClear(hwAttrs->baseAddr, status);

    if (status & (UART_INT_RX | UART_INT_RT | UART_INT_OE | UART_INT_BE |
            UART_INT_PE | UART_INT_FE)) {
        object->readFxns.readIsrFxn((UART_Handle)arg);
    }

    /* Reading the data from the FIFO doesn't mean we caught an overrrun! */
    rxErrors = MAP_UARTRxErrorGet(hwAttrs->baseAddr);
    if (rxErrors) {
        MAP_UARTRxErrorClear(hwAttrs->baseAddr);
        errorCallback((UART_Handle)arg, rxErrors);
    }

    if (status & UART_INT_TX) {
        writeData((UART_Handle)arg, true);
    }
}

/*
 *  ======== UARTCC3200_init ========
 */
void UARTCC3200_init(UART_Handle handle)
{
    UARTCC3200_Object *object = handle->object;

    object->state.opened = false;
}

/*
 *  ======== UARTCC3200_open ========
 */
UART_Handle UARTCC3200_open(UART_Handle handle, UART_Params *params)
{
    uintptr_t                    key;
    UARTCC3200_Object           *object = handle->object;
    UARTCC3200_HWAttrs const    *hwAttrs = handle->hwAttrs;
    SemaphoreP_Params            semParams;
    HwiP_Params                  hwiParams;
    ClockP_Params                clockParams;

    /* Check for callback when in UART_MODE_CALLBACK */
    DebugP_assert((params->readMode != UART_MODE_CALLBACK) ||
                  (params->readCallback != NULL));
    DebugP_assert((params->writeMode != UART_MODE_CALLBACK) ||
                  (params->writeCallback != NULL));

    key = HwiP_disable();

