robertinant/emt/src/ti/runtime/wiring/cc3200/UARTCC3200.c
    if (object->state.opened == true) {
        HwiP_restore(key);

        DebugP_log1("UART:(%p) already in use.", hwAttrs->baseAddr);
        return (NULL);
    }
    object->state.opened = true;

    HwiP_restore(key);

    object->state.readMode       = params->readMode;
    object->state.writeMode      = params->writeMode;
    object->state.readReturnMode = params->readReturnMode;
    object->state.readDataMode   = params->readDataMode;
    object->state.writeDataMode  = params->writeDataMode;
    object->state.readEcho       = params->readEcho;
    object->readTimeout          = params->readTimeout;
    object->writeTimeout         = params->writeTimeout;
    object->readCallback         = params->readCallback;
    object->writeCallback        = params->writeCallback;
    object->baudRate             = params->baudRate;
    object->stopBits             = params->stopBits;
    object->dataLength           = params->dataLength;
    object->parityType           = params->parityType;
    object->readFxns =
        staticFxnTable[object->state.readMode][object->state.readDataMode];

    /* Set UART variables to defaults. */
    object->writeBuf             = NULL;
    object->readBuf              = NULL;
    object->writeCount           = 0;
    object->readCount            = 0;
    object->writeSize            = 0;
    object->readSize             = 0;
    object->state.txEnabled      = false;

    /*
     *  Compute appropriate wait time for FIFO to empty out
     *       Total bits
     *          - 16 + 1: TX FIFO size + 1
     *          - 1 bit for start bit
     *          - 5+(object->dataLength) for total data length (5,6,7,or 8 bits)
     *          - 1+(object->stopBits) for total stop bit count (1 or 2 bits)
     *       mutiplied by 1000000 (bits / second)
     *       divided by object->baudRate (bits / second)
     *       divided by ClockP_getSystemTickPeriod() (bits (us) / SystemTick)
     *       In case of high baud rates, this tick count may be less than 1
     *          system ticks. Add 2 system ticks so that we can guarantee at
     *          least 1 system tick.
     */
    object->writeEmptyClkTimeout = ((16 + 1) * (1 + 5 + object->dataLength +
        1 + object->stopBits) * 1000000) / object->baudRate;
    object->writeEmptyClkTimeout /= ClockP_getSystemTickPeriod();
    object->writeEmptyClkTimeout += 2;

    RingBuf_construct(&object->ringBuffer, hwAttrs->ringBufPtr,
        hwAttrs->ringBufSize);

    /* Get the Power resource Id from the base address */
    object->powerMgrId = getPowerMgrId(hwAttrs->baseAddr);
    if (object->powerMgrId == (unsigned int)-1) {
        DebugP_log1("UART:(%p) Failed to determine Power resource id",
                hwAttrs->baseAddr);
        return (NULL);
    }

    /*
     *  Register power dependency. Keeps the clock running in SLP
     *  and DSLP modes.
     */
    Power_setDependency(object->powerMgrId);

    Power_registerNotify(&object->postNotify, PowerCC3200_AWAKE_LPDS,
        postNotifyFxn, (uintptr_t)handle);

    Power_setConstraint(PowerCC3200_DISALLOW_LPDS);
    object->state.rxEnabled = true;

    DebugP_log1("UART:(%p) UART_open set read power constraint",
        hwAttrs->baseAddr);

    HwiP_Params_init(&hwiParams);
    hwiParams.arg = (uintptr_t)handle;
    hwiParams.priority = hwAttrs->intPriority;
    object->hwiHandle = HwiP_create(hwAttrs->intNum, UARTCC3200_hwiIntFxn,
        &hwiParams);
    if (object->hwiHandle == NULL) {
        DebugP_log1("UART:(%p) HwiP_create() failed", hwAttrs->baseAddr);
        UARTCC3200_close(handle);
        return (NULL);
    }

    SemaphoreP_Params_init(&semParams);
    semParams.mode = SemaphoreP_Mode_BINARY;

    /* If write mode is blocking create a semaphore and set callback. */
    if (object->state.writeMode == UART_MODE_BLOCKING) {
        if ((object->writeSem = SemaphoreP_create(0, &semParams)) == NULL) {
            DebugP_log1("UART:(%p) SemaphoreP_create() failed.",
                hwAttrs->baseAddr);
            UARTCC3200_close(handle);
            return (NULL);
        }
        object->writeCallback = &writeSemCallback;
    }

    ClockP_Params_init(&clockParams);
    clockParams.arg = (uintptr_t)handle;

    /* If read mode is blocking create a semaphore and set callback. */
    if (object->state.readMode == UART_MODE_BLOCKING) {
        object->readSem = SemaphoreP_create(0, &semParams);
        if (object->readSem == NULL) {
            DebugP_log1("UART:(%p) SemaphoreP_create() failed.",
                hwAttrs->baseAddr);
            UARTCC3200_close(handle);
            return (NULL);
        }
        object->readCallback = &readSemCallback;
        object->timeoutClk =
            ClockP_create((ClockP_Fxn)&readBlockingTimeout, &(clockParams));
        if (object->timeoutClk == NULL) {
            DebugP_log1("UART:(%p) ClockP_create() failed.",
                hwAttrs->baseAddr);
            UARTCC3200_close(handle);
            return (NULL);
        }
    }
    else {
        object->state.drainByISR = false;
    }

    object->txFifoEmptyClk =
        ClockP_create((ClockP_Fxn)&releasePowerConstraint, &(clockParams));

    if (object->txFifoEmptyClk == NULL) {
        DebugP_log1("UART:(%p) ClockP_create() failed.",
                    hwAttrs->baseAddr);
        UARTCC3200_close(handle);
        return (NULL);
    }

    /* Initialize the hardware */
    initHw(handle);

    DebugP_log1("UART:(%p) opened", hwAttrs->baseAddr);

    /* Return the handle */
    return (handle);
}

/*
 *  ======== UARTCC3200_read ========
 */
int UARTCC3200_read(UART_Handle handle, void *buffer, size_t size)
{
    uintptr_t           key;
    UARTCC3200_Object  *object = handle->object;

    key = HwiP_disable();

    if ((object->state.readMode == UART_MODE_CALLBACK) && object->readSize) {
        HwiP_restore(key);

        DebugP_log1("UART:(%p) Could not read data, uart in use.",
            ((UARTCC3200_HWAttrs const *)(handle->hwAttrs))->baseAddr);
        return (UART_ERROR);
    }

