robertinant/emt/src/ti/runtime/wiring/cc3200/UARTCC3200.c
    /* Write characters. */
    while (size) {
        if (object->state.writeDataMode == UART_DATA_TEXT && *buffer == '\n') {
            MAP_UARTCharPut(hwAttrs->baseAddr, '\r');
            count++;
        }
        MAP_UARTCharPut(hwAttrs->baseAddr, *buffer);

        DebugP_log2("UART:(%p) Wrote character 0x%x", hwAttrs->baseAddr,
            *buffer);
        buffer++;
        count++;
        size--;
    }

    DebugP_log2("UART:(%p) Write polling finished, %d bytes written",
        hwAttrs->baseAddr, count);

    return (count);
}

/*
 *  ======== errorCallback ========
 *  Generic log function for when unexpected events occur.
 */
static void errorCallback(UART_Handle handle, uintptr_t error)
{
    if (error & UART_RXERROR_OVERRUN) {
        DebugP_log1("UART:(%p): OVERRUN ERROR",
            ((UARTCC3200_HWAttrs const *)handle->hwAttrs)->baseAddr);
    }
    if (error & UART_RXERROR_BREAK) {
        DebugP_log1("UART:(%p): BREAK ERROR",
            ((UARTCC3200_HWAttrs const *)handle->hwAttrs)->baseAddr);
    }
    if (error & UART_RXERROR_PARITY) {
        DebugP_log1("UART:(%p): PARITY ERROR",
            ((UARTCC3200_HWAttrs const *)handle->hwAttrs)->baseAddr);
    }
    if (error & UART_RXERROR_FRAMING) {
        DebugP_log1("UART:(%p): FRAMING ERROR",
            ((UARTCC3200_HWAttrs const *)handle->hwAttrs)->baseAddr);
    }
}

/*
 *  ======== getPowerMgrId ========
 */
static unsigned int getPowerMgrId(unsigned int baseAddr)
{
    switch (baseAddr) {
        case UARTA0_BASE:
            return (PowerCC3200_PERIPH_UARTA0);
        case UARTA1_BASE:
            return (PowerCC3200_PERIPH_UARTA1);
        default:
            return ((unsigned int)-1);
    }
}

/*
 *  ======== initHw ========
 */
static void initHw(UART_Handle handle)
{
    ClockP_FreqHz               freq;
    UARTCC3200_Object          *object = handle->object;
    UARTCC3200_HWAttrs const   *hwAttrs = handle->hwAttrs;

    /* Enable UART and its interrupt. */
    MAP_UARTIntClear(hwAttrs->baseAddr, UART_INT_TX | UART_INT_RX |
        UART_INT_RT);
    MAP_UARTEnable(hwAttrs->baseAddr);

    /* Set the FIFO level to 7/8 empty and 4/8 full. */
    MAP_UARTFIFOLevelSet(hwAttrs->baseAddr, UART_FIFO_TX1_8, UART_FIFO_RX1_8);
    /* Set flow control */
    MAP_UARTFlowControlSet(hwAttrs->baseAddr, hwAttrs->flowControl);

    ClockP_getCpuFreq(&freq);
    MAP_UARTConfigSetExpClk(hwAttrs->baseAddr, freq.lo, object->baudRate,
        dataLength[object->dataLength] | stopBits[object->stopBits] |
        parityType[object->parityType]);

    MAP_UARTIntEnable(hwAttrs->baseAddr, UART_INT_RX | UART_INT_RT |
        UART_INT_OE | UART_INT_BE | UART_INT_PE | UART_INT_FE);
}

/*
 *  ======== postNotifyFxn ========
 *  Called by Power module when waking up from LPDS.
 */
static int postNotifyFxn(unsigned int eventType, uintptr_t eventArg,
        uintptr_t clientArg)
{
    initHw((UART_Handle)clientArg);

    return (Power_NOTIFYDONE);
}

/*
 *  ======== readBlockingTimeout ========
 */
static void readBlockingTimeout(uintptr_t arg)
{
    UARTCC3200_Object *object = ((UART_Handle)arg)->object;
    object->state.bufTimeout = true;
    SemaphoreP_postFromClock(object->readSem);
}

/*
 *  ======== readIsrBinaryBlocking ========
 *  Function that is called by the ISR
 */
static bool readIsrBinaryBlocking(UART_Handle handle)
{
    UARTCC3200_Object         *object = handle->object;
    UARTCC3200_HWAttrs const  *hwAttrs = handle->hwAttrs;
    int                        readIn;

    readIn = MAP_UARTCharGetNonBlocking(hwAttrs->baseAddr);
    while (readIn != -1) {
        if (readIn > 0xFF) {
            errorCallback(handle, (readIn >> 8) & 0xF);
            MAP_UARTRxErrorClear(hwAttrs->baseAddr);
            return (false);
        }

        if (RingBuf_put(&object->ringBuffer, (unsigned char)readIn) == -1) {
            DebugP_log1("UART:(%p) Ring buffer full!!", hwAttrs->baseAddr);
            return (false);
        }
        DebugP_log2("UART:(%p) buffered '0x%02x'", hwAttrs->baseAddr,
            (unsigned char)readIn);

        if (object->state.callCallback) {
            object->state.callCallback = false;
            object->readCallback(handle, NULL, 0);
        }
        readIn = MAP_UARTCharGetNonBlocking(hwAttrs->baseAddr);
    }
    return (true);
}

/*
 *  ======== readIsrBinaryCallback ========
 */
static bool readIsrBinaryCallback(UART_Handle handle)
{
    UARTCC3200_Object         *object = handle->object;
    UARTCC3200_HWAttrs const  *hwAttrs = handle->hwAttrs;
    int                        readIn;
    bool                       ret = true;

    readIn = MAP_UARTCharGetNonBlocking(hwAttrs->baseAddr);
    while (readIn != -1) {
        if (readIn > 0xFF) {
            errorCallback(handle, (readIn >> 8) & 0xF);
            MAP_UARTRxErrorClear(hwAttrs->baseAddr);
            ret = false;
            break;
        }

        if (RingBuf_put(&object->ringBuffer, (unsigned char)readIn) == -1) {
            DebugP_log1("UART:(%p) Ring buffer full!!", hwAttrs->baseAddr);
            ret = false;
            break;
        }
        DebugP_log2("UART:(%p) buffered '0x%02x'", hwAttrs->baseAddr,
            (unsigned char)readIn);
        readIn = MAP_UARTCharGetNonBlocking(hwAttrs->baseAddr);
    }

    /*
     * Check and see if a UART_read in callback mode told use to continue
     * servicing the user buffer...
     */
    if (object->state.drainByISR) {
        readTaskCallback(handle);
    }

    return (ret);
}

/*
 *  ======== readIsrTextBlocking ========
 */
static bool readIsrTextBlocking(UART_Handle handle)
{
    UARTCC3200_Object         *object = handle->object;
    UARTCC3200_HWAttrs const  *hwAttrs = handle->hwAttrs;
    int                        readIn;

    readIn = MAP_UARTCharGetNonBlocking(hwAttrs->baseAddr);
    while (readIn != -1) {
        if (readIn > 0xFF) {
            errorCallback(handle, (readIn >> 8) & 0xF);
            MAP_UARTRxErrorClear(hwAttrs->baseAddr);
            return (false);
        }

