robertinant/emt/src/ti/runtime/wiring/cc3200/UARTCC3200.c
/*
 *  ======== releasePowerConstraint ========
 *  When a UART_write has finished or was canceled, startTxFifoEmptyClk starts a
 *  clock object to allow the TX FIFO to drain. Once the FIFO has drained we can
 *  release the deep sleep power constraint. If data is still being passed
 *  through the UART, then we'll check again in 1 system tick.
 */
static void releasePowerConstraint(UART_Handle handle)
{
    UARTCC3200_Object *object = handle->object;

    if (MAP_UARTBusy(((UARTCC3200_HWAttrs const *)handle->hwAttrs)->baseAddr)) {
        DebugP_log1("UART:(%p) UART is still busy; will check again in 1 tick",
            ((UARTCC3200_HWAttrs const *)(handle->hwAttrs))->baseAddr);
        /*
         * Somehow the UART is still busy, so restart the clock and check
         * again in 1 system tick.
         */
        ClockP_startFromISR(object->txFifoEmptyClk, 1);
        return;
    }

    /* callback moved to here for energia */
    object->writeCallback(handle, (void *)object->writeBuf,
        object->writeSize);

    Power_releaseConstraint(PowerCC3200_DISALLOW_LPDS);
    object->state.txEnabled = false;

    DebugP_log1("UART:(%p) UART released write power constraint",
        ((UARTCC3200_HWAttrs const *)(handle->hwAttrs))->baseAddr);
}

/*
 *  ======== startTxFifoEmptyClk ========
 *  Last write to TX FIFO is done, but not shifted out yet. Start a clock
 *  which will trigger when the TX FIFO should be empty.
 *
 *  @param(handle)         The UART_Handle for ongoing write.
 */
static void startTxFifoEmptyClk(UART_Handle handle, bool inIsr)
{
    UARTCC3200_Object *object = handle->object;

    if (inIsr) {
        ClockP_startFromISR(object->txFifoEmptyClk,
            object->writeEmptyClkTimeout);
    }
    else {
        ClockP_start(object->txFifoEmptyClk,
            object->writeEmptyClkTimeout);
    }
}

/*
 *  ======== writeData ========
 */
static void writeData(UART_Handle handle, bool inISR)
{
    UARTCC3200_Object         *object = handle->object;
    UARTCC3200_HWAttrs const  *hwAttrs = handle->hwAttrs;
    unsigned char             *writeOffset;

    writeOffset = (unsigned char *)object->writeBuf +
        object->writeSize * sizeof(unsigned char);

    while (object->writeCount) {
        if (!MAP_UARTCharPutNonBlocking(hwAttrs->baseAddr,
                *(writeOffset - object->writeCount))) {
            /* TX FIFO is FULL */
            break;
        }
        if ((object->state.writeDataMode == UART_DATA_TEXT) &&
            (*(writeOffset - object->writeCount) == '\n')) {
            MAP_UARTCharPut(hwAttrs->baseAddr, '\r');
        }
        object->writeCount--;
    }

    if (!object->writeCount) {
        MAP_UARTIntDisable(hwAttrs->baseAddr, UART_INT_TX);

        startTxFifoEmptyClk(handle, inISR);

        /* callback moved to TxFifoEmptyClk function for energia */
//        object->writeCallback(handle, (void *)object->writeBuf,
//            object->writeSize);

        DebugP_log2("UART:(%p) Write finished, %d bytes written",
            hwAttrs->baseAddr, object->writeSize - object->writeCount);
    }
}

/*
 *  ======== writeSemCallback ========
 *  Simple callback to post a semaphore for the blocking mode.
 */
static void writeSemCallback(UART_Handle handle, void *buffer, size_t count)
{
    UARTCC3200_Object *object = handle->object;

    SemaphoreP_postFromISR(object->writeSem);
}
